[
  {
    "topic": "Hyrox Event Structure & Demands",
    "source": "Journal of Functional Morphology and Kinesiology (2023)",
    "summary": "Hyrox: 8km run split into 1km segments, each followed by functional workout station (SkiErg, sled push/pull, burpee broad jumps, rowing, farmer's carry, sandbag lunges, wall balls). Elite times 60-75 min, average 90-120 min. Requires balanced aerobic capacity, muscular endurance, and work capacity. Different from pure running or pure CrossFit.",
    "action": "Understand event demands: 60-70% aerobic (running base critical), 30-40% strength endurance (stations). Train both equally - can't compensate weak running with strong stations or vice versa. Biggest mistake: overemphasizing one component. Balanced hybrid training produces best Hyrox results."
  },
  {
    "topic": "Hybrid Training Definition & Philosophy",
    "source": "Strength and Conditioning Journal (2023)",
    "summary": "Hybrid training combines endurance (running, cycling) with strength training. Goal: simultaneously develop aerobic capacity, strength, and power. Interference effect (endurance blunting strength gains) can be managed through proper programming. Elite hybrid athletes achieve 70-80% of specialist performance in both domains through smart training.",
    "action": "Balanced approach: 3-4 strength sessions, 3-4 endurance sessions weekly. Separate by 6+ hours when possible. Prioritize quality over volume - hybrid athletes can't train maximum volume in both modalities. Accept you won't be fastest runner or strongest lifter, but aim for well-rounded capability. Program intentionally to minimize interference."
  },
  {
    "topic": "Concurrent Training Programming",
    "source": "Sports Medicine - Concurrent Training Review (2022)",
    "summary": "Optimal concurrent training: strength before endurance if same session (preserves strength quality), 6+ hour separation ideal. Lower body strength Monday/Thursday, upper body Tuesday/Friday, running Wednesday/Saturday/Sunday works well. Polarized intensity (80% easy, 20% hard) applies to both strength and endurance for hybrid athletes.",
    "action": "Weekly structure: Mon - Lower body strength + easy run, Tue - Upper body + tempo run, Wed - Easy run, Thu - Lower body strength, Fri - Upper body + intervals, Sat - Long run, Sun - Active recovery or Hyrox simulation. Separate hard days from hard days. Don't do hard strength and hard running same day."
  },
  {
    "topic": "Running Volume for Hybrid Athletes",
    "source": "International Journal of Sports Physiology (2023)",
    "summary": "Hybrid athletes need 30-50km weekly running for Hyrox performance. More volume improves aerobic base but risks interference with strength. Sweet spot: 35-40km weekly (4-5 runs) maintains endurance without excessive fatigue. 80% easy pace, 20% threshold/interval work. Long run 12-16km weekly develops aerobic capacity without destroying legs.",
    "action": "Weekly running plan: 3-4 easy runs (5-8km each at conversational pace), 1 tempo/interval session (6-10km with intervals), 1 long run (12-16km easy). Total: 35-45km weekly. More than 50km risks interference with strength gains. Quality over quantity - focus on efficient running, not endless mileage."
  },
  {
    "topic": "Strength Training for Hyrox",
    "source": "Journal of Strength and Conditioning Research (2023)",
    "summary": "Hyrox requires strength endurance, not max strength. Rep ranges: 8-15 reps, 3-4 sets, moderate loads (60-75% 1RM). Focus: sled push/pull variations, farmer's carries, goblet squats, wall balls, rowing strength. Posterior chain (glutes, hamstrings) critical for running and sled work. Circuit-style training mimics event demands.",
    "action": "Station-specific strength: 2-3× weekly. Include: sled pushes (heavy for 20-40m), sled pulls (standing position), farmer's carries (heavy for 200m), wall balls (50-100 reps), sandbag work, rowing intervals. Use 8-12 rep range for muscular endurance. Add compound lifts (squats, deadlifts) for base strength but not exclusively."
  },
  {
    "topic": "Work Capacity Development",
    "source": "Sports Medicine - Work Capacity (2022)",
    "summary": "Work capacity (ability to sustain high output over extended period) separates good from elite Hyrox athletes. Develops through interval circuits, EMOM (every minute on minute) workouts, and Hyrox simulations. Requires 8-12 weeks to build. Progressive overload: increase density (less rest), volume (more work), or intensity (heavier loads).",
    "action": "Work capacity session (1× weekly): 30-40 min circuit alternating cardio + strength (example: 400m run, 20 wall balls, 200m row, 15 burpees, 400m run, 40m sled push, repeat). Minimal rest between stations. Builds specific Hyrox endurance. Start conservative, progress weekly. This is where Hyrox fitness is built."
  },
  {
    "topic": "Hyrox Race Simulation Training",
    "source": "International Journal of Sports Performance (2023)",
    "summary": "Full or half Hyrox simulations (race pace practice) essential 3-6 weeks out from competition. Reveals pacing weaknesses, station strategy, fueling needs, mental fatigue points. Full simulation highly fatiguing - requires 7-10 days recovery. Half simulations (4km + 4 stations) less taxing, can do every 2-3 weeks. Practice makes perfect.",
    "action": "Simulation protocol: 4-6 weeks out, do half simulation (4km + 4 stations) at goal race pace. Test fueling, pacing, transitions. 2-3 weeks out, full simulation at 85-90% effort. Note: which stations felt hardest? Where did running pace drop? Use data to adjust final training weeks. Simulation reveals truth about fitness gaps."
  },
  {
    "topic": "Station-Specific Technique",
    "source": "Journal of Functional Training (2023)",
    "summary": "Technique efficiency saves massive time: proper sled push form (low position, drive through legs), efficient burpee broad jump (minimize air time), wall ball rhythm (catch and throw in one motion). Poor technique wastes 30-40% more energy. Technique practice separate from conditioning - learn skills when fresh, then apply under fatigue.",
    "action": "Weekly technique work: 2× weekly, when fresh (pre-fatigue), practice station movements focusing on efficiency. Film yourself, compare to elite athletes. Key focuses: sled push angle (low hip position), burpee jump (step back instead of jump down), wall ball rhythm (no pause at bottom). Technique = free speed."
  },
  {
    "topic": "Transition Speed & Strategy",
    "source": "Sports Performance Analysis (2023)",
    "summary": "Transitions between run and stations cost 10-20 seconds if sloppy. Elite athletes transition smoothly: controlled breathing, immediate setup, no wasted movement. Practice transitions in training. Mental preparation for next station during final 200m of run segment. Smooth transitions maintain momentum and heart rate management.",
    "action": "Transition practice: During simulation runs, practice entering stations with controlled breathing, immediately grabbing equipment, starting work smoothly. Don't crash into stations gasping - last 200m of run segment, prepare mentally and breathe deeply. Rehearse equipment setup. Save 5-10 seconds per transition = 40-80 seconds total race time."
  },
  {
    "topic": "Pacing Strategy for Hyrox",
    "source": "International Journal of Sports Physiology (2022)",
    "summary": "Optimal Hyrox pacing: conservative first 2 run segments (slower than goal pace by 5-10 sec/km), settle into rhythm segments 3-5, push segments 6-8 if feeling strong. Stations should feel hard but sustainable - going too hard early on stations destroys running legs. Even pacing across all 8 segments beats aggressive early effort.",
    "action": "Race pacing plan: Runs 1-2 at goal pace minus 10 sec/km (control adrenaline), runs 3-5 at goal pace, runs 6-8 increase effort if strong. Stations: aim for 90% effort, not 100% (except wall balls - last station, empty tank). Monitor breathing - if gasping after station, too hard. Sustainable effort beats heroic burnout."
  },
  {
    "topic": "SkiErg Technique & Strategy",
    "source": "Journal of Strength and Conditioning Research (2022)",
    "summary": "SkiErg (1000m, typically first station): technique matters enormously. Power comes from core and lats, not arms. Common mistake: all arms, no hip hinge. Efficient athletes use hinge pattern (similar to kettlebell swing). Pacing: start controlled, find sustainable rhythm. Going too hard depletes shoulders for wall balls later.",
    "action": "SkiErg technique: Stand close to machine, hinge at hips (don't squat), explosive pull through lats and core, arms finish movement. Practice 2× weekly (200-300m efforts). Race strategy: start at comfortable pace, don't chase fast starters. Target 1000m in 3:30-4:30 depending on ability. Consistent rhythm > sprinting."
  },
  {
    "topic": "Sled Push & Pull Strategy",
    "source": "Strength and Conditioning Journal (2023)",
    "summary": "Sled push (2×25m): low position, drive through legs, maintain momentum. Standing up = inefficient. Sled pull: lean back, engage lats, short steps. Biggest mistake: stopping between laps (hard to restart). Smooth turnarounds maintain momentum. These stations destroy quads for subsequent runs - pacing critical.",
    "action": "Sled technique: Push - hands low, hips low, drive legs powerfully. Don't look up (raises hips). Pull - lean back, pull through lats, quick short steps. Race strategy: smooth consistent effort, don't stop at turnaround (costs 5-10 sec). Practice loaded sled work 2× weekly. Strong legs = fast sled work."
  },
  {
    "topic": "Burpee Broad Jump Execution",
    "source": "Journal of Functional Fitness (2023)",
    "summary": "Burpee broad jumps (80m): most hated station. Efficiency critical - step back instead of jump down, minimal air time on jump, find rhythm. Breaking into sets (10-15 reps, brief pause) often faster than grinding continuously. Mental game important - this station breaks people mentally.",
    "action": "Technique: Step back to plank (don't jump), push up (chest to ground), step/hop feet forward, broad jump forward. Don't jump high - forward distance only. Race strategy: sets of 12-15, 2-3 second pause between sets. Count reps (typically 35-45 total). Mental toughness station - embrace suck, stay moving. Practice 2× weekly."
  },
  {
    "topic": "Rowing Station Strategy",
    "source": "Sports Medicine - Rowing Performance (2022)",
    "summary": "Rowing 1000m: comes after 5km running + 4 stations (legs are destroyed). Technique saves energy - power from legs, not arms. Damper setting 4-6 optimal for most. Pacing: start controlled (don't sprint), find sustainable stroke rate (24-28 spm), finish strong last 250m. Efficient rowing technique = faster times with less fatigue.",
    "action": "Rowing technique: Legs-core-arms on drive, reverse on recovery. Keep stroke rate 24-28 (not 30+). Race strategy: start at comfortable pace (don't blow up), consistent effort middle 500m, increase final 250m. Target splits depend on ability (1:45-2:10 per 500m typical). Practice rowing 2× weekly, focus on technique not just power."
  },
  {
    "topic": "Farmer's Carry & Sandbag Lunges",
    "source": "Journal of Strength and Conditioning Research (2023)",
    "summary": "Farmer's carry (2×100m with kettlebells): grip and core endurance. Don't put weights down if possible (restarting costs time). Sandbag lunges (100m): quad destroyer after 7km running. Continuous movement faster than resting. Both stations require mental toughness more than physical strength.",
    "action": "Farmer's carry: Grip tight, shoulders back, quick short steps. Don't stop unless grip failing. Turnaround smooth (don't drop weights). Sandbag lunges: High bag position (on shoulders), alternating legs, continuous rhythm. Don't pause between reps. Race strategy: steady pace, don't stop. Practice both 1-2× weekly with heavy loads."
  },
  {
    "topic": "Wall Balls - Final Station",
    "source": "CrossFit Journal - Wall Ball Analysis (2022)",
    "summary": "Wall balls (100 reps to 10ft target): final station after 8km running + 7 stations. Legs are destroyed, shoulders are fatigued. Rhythm critical - catch ball, descend into squat, explode up, throw in one motion. Breaking into sets (25-30, quick break) often faster than grinding. Mental game - final station, leave everything on floor.",
    "action": "Wall ball technique: Catch ball, descend to squat, explosive hip drive, throw at top. Find rhythm - no pauses between reps. Race strategy: aim for 30-35 continuous reps, 3-5 sec break, repeat. Don't go max effort first set (will pay later). Count reps carefully. Last station - empty the tank completely. Finish strong."
  },
  {
    "topic": "Recovery Between Hyrox Training Sessions",
    "source": "International Journal of Sports Physiology (2023)",
    "summary": "Hyrox training is extremely demanding - combines high running volume with strength work. Requires 48 hours between hard sessions. Sleep 8-9 hours minimum during heavy training. Nutrition critical - adequate protein (1.8-2.2g/kg) and carbs (4-6g/kg). Underfueling hybrid training leads to injury and burnout. Recovery is where fitness is built.",
    "action": "Recovery priorities: 1) 8-9 hours sleep nightly, 2) 1.8-2.2g protein per kg bodyweight daily, 3) 4-6g carbs per kg (fuel for both strength and running), 4) Foam rolling and mobility work daily (10-15 min), 5) At least 2 full rest days weekly. Don't try to max out both running and lifting volume - recipe for injury."
  },
  {
    "topic": "Hyrox Taper Protocol",
    "source": "Sports Medicine - Competition Preparation (2023)",
    "summary": "Hyrox taper: 2 weeks reduced volume (drop 40-50%), maintain intensity. Week before race: 2-3 easy runs (3-5km), 1 light technical session practicing stations, 2 full rest days. No hard efforts within 5 days of race. Focus on sleep, nutrition, mental preparation. Trust training - taper allows supercompensation.",
    "action": "Two-week taper: Week 2 out - reduce volume 40%, keep 1 hard session (threshold run + stations). Week 1 out - easy runs only, light station technique work (low volume), increase sleep, eat clean. Last hard session 6-7 days before race. Days 1-2 before race: complete rest or 10-15 min easy movement. Race day: trust preparation."
  }
]
