[
  {
    "topic": "Warm-Up Protocol",
    "source": "British Journal of Sports Medicine (2020)",
    "summary": "Proper warm-up reduces injury risk by 30-50% and improves performance by 5-10%. Effective warm-ups include: 5-10 min general movement (raises body temp), dynamic stretching (activates muscles), and sport-specific drills (primes nervous system). Static stretching pre-workout impairs power output by 5-8%.",
    "action": "Standard warm-up structure: 1) 5-10 min easy movement (jog, bike, jump rope), 2) Dynamic stretching (leg swings, arm circles, walking lunges), 3) Activation drills (glute bridges, clamshells), 4) Sport-specific movement (strides, practice starts). Total: 15-20 min. Never skip warm-up before hard sessions."
  },
  {
    "topic": "Dynamic Stretching vs Static Stretching",
    "source": "Sports Medicine - Stretching Review (2021)",
    "summary": "Dynamic stretching (controlled movement through range) before exercise improves performance and reduces injury risk by 10-15%. Static stretching (holding position 30+ sec) pre-workout may reduce power by 5-8%. Static stretching post-workout improves flexibility and aids recovery. Use each at appropriate time.",
    "action": "Pre-workout: Dynamic stretches only (leg swings, walking lunges, arm circles, torso rotations). 5-10 min total. Post-workout: Static stretching (30-60 sec holds per muscle group, 10-15 min total). Focus on muscles used most. Save deep stretching/yoga for rest days or evening."
  },
  {
    "topic": "Load Management & 10% Rule",
    "source": "British Journal of Sports Medicine - Load Study (2021)",
    "summary": "Rapid increases in training load (volume or intensity) cause 80% of overuse injuries. The '10% rule' (increase weekly volume by max 10%) reduces injury risk by 50-60%. Acute spikes in load, not total volume, are primary injury cause. Progressive adaptation requires gradual loading.",
    "action": "Track weekly training volume (time or distance). Increase by maximum 10% per week. If taking time off, return at 50-60% previous volume, rebuild gradually. Use 3:1 ratio: 3 weeks building, 1 week easy. Sudden jumps (15%+ increases) exponentially increase injury risk."
  },
  {
    "topic": "Acute to Chronic Workload Ratio",
    "source": "Journal of Orthopaedic & Sports Physical Therapy (2020)",
    "summary": "ACWR compares recent load (1 week) to chronic load (4-week average). Sweet spot: 0.8-1.3 ratio. ACWR above 1.5 increases injury risk 200-300%. Rapid spikes detected before athlete feels symptoms. Useful for preventing overuse injuries, especially in runners and endurance athletes.",
    "action": "Calculate weekly: This week's training / 4-week average. Keep ratio between 0.8-1.3. If above 1.5, reduce next week's volume 20-30%. If below 0.8 (detraining), increase gradually. Use apps or spreadsheets to track. Most useful during base building and volume phases."
  },
  {
    "topic": "Strength Training for Injury Prevention",
    "source": "British Journal of Sports Medicine - Injury Prevention (2021)",
    "summary": "Strength training reduces overuse injury risk by 30-50% in endurance athletes. Eccentric strength (controlling load during lengthening) particularly protective. 2-3 strength sessions per week optimal. Focus on posterior chain (glutes, hamstrings) and single-leg stability reduces running injuries significantly.",
    "action": "Twice weekly: Compound lifts (squats, deadlifts, single-leg work) + posterior chain emphasis (Nordic curls, Romanian deadlifts, hip thrusts). 3-4 sets of 6-10 reps. Include single-leg exercises (Bulgarian split squats, single-leg deadlifts) for stability. Maintain year-round, not just during base phase."
  },
  {
    "topic": "Mobility vs Flexibility",
    "source": "Journal of Strength and Conditioning Research (2020)",
    "summary": "Flexibility (passive range of motion) differs from mobility (active control through range). Mobility training more functional for injury prevention than static flexibility. Joint mobility (hips, ankles, shoulders, thoracic spine) directly impacts movement quality and injury risk. Most athletes lack mobility, not flexibility.",
    "action": "Daily 10-min mobility routine: Ankle circles, hip CARs (controlled articular rotations), thoracic rotations, shoulder circles. Focus on joints used most in your sport. Pre-workout: dynamic mobility. Post-workout: some static stretching. Address specific limitations with targeted daily work (e.g., hip mobility for runners)."
  },
  {
    "topic": "Common Running Injury Prevention",
    "source": "Sports Medicine - Running Injuries Review (2021)",
    "summary": "Most common running injuries: IT band syndrome, plantar fasciitis, shin splints, runner's knee, Achilles tendinopathy. 80% are overuse injuries from training errors (too much, too fast, too soon). Prevention: gradual load increases, strength training, proper footwear, running form awareness.",
    "action": "Prevention checklist: 1) Follow 10% rule for volume increases, 2) Strength train 2× weekly (glutes, hips, calves), 3) Replace shoes every 300-500 miles, 4) Include easy days (80% of runs), 5) Cross-train 1-2× weekly, 6) Address pain early (don't run through it). Most injuries preventable with smart training."
  },
  {
    "topic": "Tissue Adaptation Timeline",
    "source": "Scandinavian Journal of Medicine & Science in Sports (2020)",
    "summary": "Different tissues adapt at different rates: Aerobic system (2-4 weeks), muscles (4-8 weeks), tendons (8-12 weeks), bones (12-16 weeks). Training progression must respect slowest-adapting tissue. Rapid progressions cause tendon/bone injuries while muscles/aerobic system handle load. Patience prevents injury.",
    "action": "Beginners and returning athletes: Build volume very gradually over 12-16 weeks (bone/tendon adaptation time). Even if you feel strong, connective tissue needs time. Err on side of slower progression. If increasing running volume, wait 6-8 weeks before adding intensity. Respect tissue adaptation timelines."
  },
  {
    "topic": "Movement Quality Assessment",
    "source": "Journal of Orthopaedic & Sports Physical Therapy (2021)",
    "summary": "Poor movement patterns (knee valgus, excessive pronation, hip drop) increase injury risk by 40-60%. Single-leg squat reveals imbalances and weakness. Video analysis helps identify compensations. Fixing movement quality more important than increasing training load. Quality before quantity.",
    "action": "Monthly assessment: Video yourself doing single-leg squat from front and side. Check for: knee caving inward, hip dropping, excessive trunk lean, ankle rolling. If present, address with strength work (glute med, hip stability) and mobility. Fix movement issues before progressing training intensity."
  },
  {
    "topic": "Hip Mobility for Runners",
    "source": "International Journal of Sports Physical Therapy (2020)",
    "summary": "Limited hip mobility (especially hip flexor tightness and hip internal rotation) causes compensations leading to IT band, knee, and lower back injuries. Sitting 8+ hours daily creates chronic hip flexor tightness that impairs running mechanics. Hip mobility is #1 priority for desk-job athletes.",
    "action": "Daily hip routine (10 min): 1) Hip flexor stretches (couch stretch, 90/90 position), 2) Hip CARs (controlled circles), 3) 90/90 sit transitions, 4) Pigeon pose. Do after runs or before bed. If sitting all day, stand/walk every 60 min. Hip mobility directly impacts running form and injury risk."
  },
  {
    "topic": "Ankle Mobility & Stability",
    "source": "Journal of Athletic Training (2021)",
    "summary": "Ankle dorsiflexion (shin moving over toe) essential for proper squat depth and running mechanics. Limited ankle mobility causes compensations (knee valgus, heel lift) increasing injury risk. Ankle stability (strength in end ranges) prevents sprains. Most athletes lack both mobility and stability.",
    "action": "Ankle mobility: Kneeling ankle stretch against wall (3 × 30 sec each side daily). Test: Can you touch knee to wall 4+ inches from toes? If not, prioritize ankle mobility. Ankle stability: Single-leg balance (30-60 sec), heel raises (3 × 15 reps), resistance band eversion/inversion. Do 3× weekly."
  },
  {
    "topic": "Thoracic Spine Mobility",
    "source": "Physical Therapy in Sport (2020)",
    "summary": "Thoracic spine stiffness causes shoulder and neck issues, impairs breathing mechanics, and affects running posture. Modern lifestyle (sitting, screens) promotes thoracic immobility. Improving thoracic rotation and extension reduces upper body compensation injuries by 25-30%. Often overlooked by athletes.",
    "action": "Daily thoracic mobility: 1) Cat-cow stretches (10 reps), 2) Thoracic rotations on foam roller (10 each side), 3) Wall angels (10 reps), 4) Thread the needle stretch (30 sec each side). Focus on extension and rotation. Especially important for swimmers, cyclists, and desk workers. Takes 5-10 min."
  },
  {
    "topic": "Proprioception & Balance Training",
    "source": "Sports Medicine - Injury Prevention Review (2021)",
    "summary": "Proprioception (body awareness in space) declines with age and after injury. Balance training reduces ankle sprains by 35-40% and improves running economy by 2-3%. Single-leg balance challenges proprioception and reveals imbalances. Stability work prevents injuries and improves performance.",
    "action": "2-3× weekly: Single-leg balance progressions. Start: 30 sec eyes open. Progress to: eyes closed, unstable surface (pillow), adding movement (ball toss). Include in warm-up or post-workout. After injury, proprioception must be retrained - balance work is critical during rehab."
  },
  {
    "topic": "Shoe Selection & Replacement",
    "source": "British Journal of Sports Medicine (2020)",
    "summary": "Running shoes lose cushioning after 300-500 miles, increasing impact forces by 20-30%. Worn shoes increase injury risk significantly. Shoe type matters less than replacing on schedule and gradual break-in. Minimalist transition requires 6-12 months gradual adaptation. Choose shoes that feel comfortable, not based on trend.",
    "action": "Track shoe mileage (write date purchased inside shoe). Replace every 300-500 miles depending on weight and running surface. Break in new shoes gradually (alternate with old pair for 2 weeks). If switching shoe types dramatically, allow 8-12 weeks transition. Comfort > brand marketing."
  },
  {
    "topic": "Cross-Training Benefits",
    "source": "Sports Medicine - Cross-Training Review (2021)",
    "summary": "Cross-training (non-primary sport activities) reduces overuse injury risk by 40-50%, maintains fitness during injury, and provides mental break. Low-impact options (cycling, swimming, elliptical) maintain aerobic fitness without loading impact-prone tissues. One cross-training session per week optimal for injury prevention.",
    "action": "Include 1-2 weekly cross-training sessions: cycling, swimming, elliptical, or rowing. Use as active recovery or to replace one running/high-impact session. Particularly useful during high mileage phases or when minor niggles appear. Maintains fitness while reducing repetitive stress."
  },
  {
    "topic": "Early Injury Warning Signs",
    "source": "Clinical Journal of Sport Medicine (2020)",
    "summary": "Most overuse injuries preventable if caught early. Warning signs: pain that worsens during activity, pain lasting 2+ hours post-training, pain that alters gait/form, pain that doesn't improve with 2-3 days rest. Ignoring early signals turns minor issues into major injuries requiring weeks off.",
    "action": "If experiencing pain: 1) Take 2-3 days complete rest immediately, 2) If pain persists, see physical therapist (don't wait weeks), 3) Never run through pain that alters form, 4) Address underlying cause (strength deficits, mobility issues, training errors). Early intervention prevents weeks-long layoffs."
  },
  {
    "topic": "Foam Rolling Technique",
    "source": "International Journal of Sports Physical Therapy (2021)",
    "summary": "Foam rolling (self-myofascial release) reduces muscle soreness by 15-20%, improves range of motion by 10-15%, and may enhance recovery. Most effective when done slowly (1 inch per second), spending 30-90 seconds per muscle. Does not 'break up scar tissue' but reduces neural tension and increases blood flow.",
    "action": "Post-workout or pre-bed: Roll major muscle groups slowly (quads, hamstrings, calves, glutes, IT band, lats). 30-60 sec per area. Pause on tender spots, breathe deeply. Don't roll too aggressively (painful = counterproductive). Consistency matters more than intensity. 10-15 min total, 3-5× weekly."
  },
  {
    "topic": "Glute Activation & Strength",
    "source": "Journal of Orthopaedic & Sports Physical Therapy (2020)",
    "summary": "Weak glutes are primary cause of running injuries - IT band syndrome, runner's knee, hip pain, lower back pain. Modern lifestyle (sitting) causes 'glute amnesia' - glutes don't activate properly. Glute strength work reduces running injury risk by 30-40%. Single most important injury prevention exercise for runners.",
    "action": "Pre-run activation (5 min): Glute bridges (20 reps), clamshells (15 each side), lateral band walks (10 each direction). Strength work (2× weekly): Hip thrusts (3 × 10), single-leg deadlifts (3 × 8 each), Bulgarian split squats (3 × 10 each). Strong glutes = injury-free running."
  },
  {
    "topic": "Tendon Loading Principles",
    "source": "British Journal of Sports Medicine - Tendinopathy (2021)",
    "summary": "Tendons strengthen through progressive loading but require 48-72 hours recovery between loads. Tendinopathy (chronic tendon pain) results from insufficient recovery between loading sessions. Heavy slow resistance (3-5 reps) and explosive plyometrics both strengthen tendons. Avoid moderate rep ranges (8-15) during tendon rehab.",
    "action": "For tendon health: Include heavy strength work (3-6 reps, compound lifts) 2× weekly. Allow 48-72 hours between high-load sessions. If experiencing tendon pain (Achilles, patellar), work with physical therapist - requires specific loading protocols. Don't stretch painful tendons - load them correctly instead."
  },
  {
    "topic": "Running Form & Cadence",
    "source": "Journal of Sports Sciences (2020)",
    "summary": "Cadence (steps per minute) affects impact forces - higher cadence (170-180+ spm) reduces impact loading by 10-20% and lowers injury risk. Overstriding (landing far ahead of center of mass) increases braking forces and injury risk. Small increases in cadence (5-10%) improve running economy without feeling forced.",
    "action": "Check current cadence (count steps one foot, 30 sec, multiply by 4). If under 170 spm, gradually increase by 5% over 4-6 weeks (use metronome app). Focus on quick, light steps. Cadence increase naturally shortens stride and reduces overstriding. Don't force change too quickly - adapt gradually."
  }
]
