[
  {
    "topic": "Pre-Workout Nutrition Timing",
    "source": "Journal of the International Society of Sports Nutrition (2021)",
    "summary": "Pre-workout meals should be consumed 2-4 hours before training (larger meals need more time). Carbs (1-4g per kg bodyweight) provide fuel, moderate protein (15-25g) prevents breakdown. Eating too close to training (under 60 min) causes GI distress. Fat should be minimal as it slows digestion.",
    "action": "Main meal: 3-4 hours before (balanced carbs + protein). Snack: 60-90 min before (easily digestible carbs like banana, rice cake, energy bar). Within 30 min: only simple carbs if needed. Experiment to find personal tolerance window."
  },
  {
    "topic": "Intra-Workout Fueling",
    "source": "Sports Medicine - Exercise Nutrition (2020)",
    "summary": "For sessions under 60 minutes, water is sufficient. Sessions 60-90 minutes benefit from 30-60g carbs per hour (sports drink, gels). Over 90 minutes require 60-90g carbs per hour using multiple carb sources (glucose + fructose) for better absorption.",
    "action": "Under 60 min: water only. 60-90 min: 30-60g carbs/hour (1 gel or 16-24oz sports drink). 90+ min: 60-90g carbs/hour, mix glucose and fructose sources. Practice fueling in training, never try new strategies on race day."
  },
  {
    "topic": "Post-Workout Nutrition Window",
    "source": "Journal of the International Society of Sports Nutrition (2020)",
    "summary": "Post-workout 'anabolic window' is 0-2 hours but not as narrow as once thought. Protein (20-40g) and carbs (0.5-1g per kg bodyweight) consumed within 2 hours optimize recovery. If pre-workout meal was recent (within 3 hours), urgency decreases. Total daily intake matters more than precise timing.",
    "action": "Within 60 minutes post-workout: 20-40g protein + carbs (3:1 or 4:1 carb-to-protein ratio). Example: protein shake with banana and oats, or chicken with rice. If training again within 24 hours, prioritize this meal. If next session is 48+ hours away, timing is less critical."
  },
  {
    "topic": "Protein Requirements for Athletes",
    "source": "American Journal of Clinical Nutrition (2020)",
    "summary": "Athletes need 1.6-2.2g protein per kg bodyweight daily for optimal recovery and muscle building. Endurance athletes: 1.4-1.8g/kg. Strength athletes: 1.8-2.2g/kg. Distribute across 4-5 meals (20-40g per meal) for maximum muscle protein synthesis. Timing matters less than total daily intake.",
    "action": "Calculate needs: bodyweight (kg) × 1.6-2.2g. Divide into 4-5 meals. Prioritize: breakfast (20-30g), post-workout (30-40g), before bed (20-30g). Track for 3-5 days to ensure you're hitting targets consistently."
  },
  {
    "topic": "Carbohydrate Loading",
    "source": "Sports Medicine - Glycogen Supercompensation (2021)",
    "summary": "Carb loading increases muscle glycogen stores 25-50% above normal, improving endurance performance by 2-5%. Protocol: 7-10g carbs per kg bodyweight for 24-36 hours before events over 90 minutes. Taper training simultaneously. Most effective for glycogen-dependent events (marathons, long races).",
    "action": "2-3 days before race: Reduce training volume by 60-80%, increase carbs to 8-10g per kg bodyweight. Focus on easily digestible carbs (white rice, pasta, bread, potatoes). Avoid excess fiber and fat. Example: 70kg runner needs 560-700g carbs daily for 2 days."
  },
  {
    "topic": "Fat Adaptation Training",
    "source": "Journal of Applied Physiology (2020)",
    "summary": "Training in low-carb states (fasted or low glycogen) increases fat oxidation by 20-40% but impairs high-intensity performance. 'Train low, compete high' approach: some easy sessions fasted/low-carb to boost fat burning, but fuel hard sessions and races fully with carbs.",
    "action": "Advanced strategy: Do 1-2 easy Zone 2 sessions per week fasted or low-carb (morning before breakfast, or after depleting glycogen). Keep duration under 90 min. Always fuel hard sessions, intervals, and long runs normally. Not suitable for beginners or during race prep."
  },
  {
    "topic": "Hydration Strategy",
    "source": "Sports Medicine - Hydration Guidelines (2021)",
    "summary": "Aim to limit fluid loss to under 2% bodyweight during exercise. Pre-hydrate with 5-10ml per kg bodyweight 2-4 hours before. During exercise, drink 400-800ml per hour depending on sweat rate. Post-exercise, replace 150% of fluid lost (if lost 1L, drink 1.5L over 2-4 hours).",
    "action": "Calculate sweat rate: weigh before/after 60 min training session (1 lb loss = 16oz fluid). Drink 50-75% of sweat rate during exercise. Use sports drinks for sessions over 60 min. Urine should be pale yellow - dark yellow means under-hydrated."
  },
  {
    "topic": "Electrolyte Replacement",
    "source": "Journal of the International Society of Sports Nutrition (2020)",
    "summary": "Sodium is the primary electrolyte lost in sweat (500-2000mg per hour depending on individual). Sodium losses impair performance and increase cramp risk. Potassium and magnesium also important but losses are lower. Plain water dilutes electrolytes - use sports drinks or salt tablets for sessions over 60-90 min.",
    "action": "For sessions over 60 min or heavy sweating: consume 300-700mg sodium per hour (check sports drink labels or use 1/4 tsp salt per 16oz water). Heavy sweaters or salty sweaters need upper range. Post-workout: eat salty foods or add salt to recovery meal."
  },
  {
    "topic": "Caffeine for Performance",
    "source": "British Journal of Sports Medicine (2020)",
    "summary": "Caffeine (3-6mg per kg bodyweight) consumed 30-60 min before exercise improves endurance by 2-4%, strength by 3-5%, and perceived effort. Higher doses (9+ mg/kg) cause jitters and GI issues without added benefit. Tolerance develops with daily use. Timing and dosage are critical.",
    "action": "Pre-workout caffeine: 3-6mg per kg (70kg athlete = 210-420mg = 2-3 cups coffee or 1-2 caffeine pills). Take 45-60 min before start. If you use caffeine daily, may need upper range. Avoid if training after 3pm (affects sleep). Test in training before using in competition."
  },
  {
    "topic": "Race Day Fueling Strategy",
    "source": "Sports Medicine - Competition Nutrition (2021)",
    "summary": "Race day nutrition starts 24-48 hours before with carb loading. Morning of: familiar breakfast 3-4 hours pre-race. During race: 30-60g carbs per hour for events under 2.5 hours, 60-90g per hour for longer events. Never experiment on race day - use only tested strategies.",
    "action": "48h before: carb load (8-10g/kg). Morning: breakfast 3-4h before (oatmeal, toast, banana). 30-60 min before: energy gel if desired. During: practice fueling plan (gels, chews, sports drink). Post: protein + carbs within 30-60 min. Stick to familiar foods only."
  },
  {
    "topic": "Protein Timing Distribution",
    "source": "Nutrients - Protein Synthesis Study (2020)",
    "summary": "Distributing protein across 4-5 meals (20-40g per meal) stimulates muscle protein synthesis more effectively than eating most protein in 1-2 large meals. Each protein feeding creates 3-5 hour synthesis window. Pre-sleep protein (20-40g casein) supports overnight recovery.",
    "action": "Spread protein: breakfast (20-30g), lunch (30-40g), pre-workout snack (15-20g), post-workout (30-40g), dinner (30-40g), pre-bed (20-30g). Aim for 20-40g per meal. Pre-sleep protein especially important for muscle building and recovery."
  },
  {
    "topic": "Creatine Supplementation",
    "source": "Journal of the International Society of Sports Nutrition (2021)",
    "summary": "Creatine monohydrate (5g daily) increases muscle creatine stores by 20-40%, improving high-intensity performance by 5-15%. Loading phase (20g daily for 5-7 days) saturates stores faster but isn't necessary. Most researched and effective supplement for power/strength athletes. Safe for long-term use.",
    "action": "Take 5g creatine monohydrate daily, any time of day, with or without food. Optional loading: 20g daily (4 × 5g) for 5-7 days, then 5g daily maintenance. Drink extra water (creatine increases water retention). Effects noticeable after 1-2 weeks. Works best for high-intensity, short-duration efforts."
  },
  {
    "topic": "Beta-Alanine for Endurance",
    "source": "Amino Acids Journal (2020)",
    "summary": "Beta-alanine (4-6g daily for 4+ weeks) increases muscle carnosine, buffering lactic acid during high-intensity efforts lasting 1-10 minutes. Improves performance in 800m-5K events and high-intensity intervals by 2-3%. Requires 4 weeks loading to see benefits. May cause harmless tingling sensation.",
    "action": "Take 4-6g beta-alanine daily, split into 2 doses (2-3g each) to reduce tingling. Load for 4-6 weeks before expecting benefits. Most useful for track runners, rowers, and cyclists doing VO2 max intervals. Combine with creatine for synergistic effects."
  },
  {
    "topic": "Iron Status for Athletes",
    "source": "Sports Medicine - Iron Deficiency (2021)",
    "summary": "Iron deficiency (even without anemia) impairs endurance performance by 5-10% and causes fatigue. Endurance athletes, especially female runners, at high risk due to impact hemolysis and menstrual losses. Ferritin levels should be 30-50+ ng/mL for optimal performance. Test annually.",
    "action": "Get ferritin tested annually or if experiencing unexplained fatigue. If ferritin under 30 ng/mL: supplement with 25-50mg elemental iron daily with vitamin C (improves absorption). Take on empty stomach if tolerated. Retest after 8-12 weeks. Heme iron (meat) absorbs better than non-heme (plants)."
  },
  {
    "topic": "Vitamin D for Performance",
    "source": "Nutrients - Vitamin D Review (2020)",
    "summary": "Vitamin D deficiency (under 30 ng/mL) impairs muscle function, increases injury risk, and compromises immune function. Athletes in northern climates or who train indoors at high risk. Optimal levels: 40-60 ng/mL. Supplementation (2000-4000 IU daily) corrects deficiency in 8-12 weeks.",
    "action": "Test vitamin D levels (25-hydroxyvitamin D). If under 30 ng/mL: supplement 2000-4000 IU daily with fat-containing meal. If under 20 ng/mL: may need higher doses initially. Retest after 3 months. Maintain year-round, especially winter months."
  },
  {
    "topic": "Omega-3 Fatty Acids",
    "source": "Journal of the International Society of Sports Nutrition (2020)",
    "summary": "Omega-3s (EPA/DHA) reduce exercise-induced inflammation by 15-20%, improve recovery, support joint health, and may enhance muscle protein synthesis. Athletes need 2-3g EPA+DHA daily (higher than general population). Fish oil is most bioavailable form. Anti-inflammatory effects support recovery.",
    "action": "Consume fatty fish (salmon, mackerel, sardines) 2-3× per week OR supplement with 2-3g combined EPA+DHA daily. Take with meals for better absorption. Choose high-quality, third-party tested brands. Especially beneficial during high-volume training blocks."
  },
  {
    "topic": "Nitrate Supplementation",
    "source": "Sports Medicine - Nitrate Review (2021)",
    "summary": "Dietary nitrates (from beetroot juice or supplements) improve blood flow and oxygen efficiency, enhancing endurance performance by 1-3%. Effective dose: 6-8mmol nitrate (500ml beetroot juice) consumed 2-3 hours before exercise. Most beneficial for endurance events lasting 4-30 minutes.",
    "action": "For endurance events: drink 500ml beetroot juice 2-3 hours pre-race (or 400-600mg nitrate supplement). Use for 3-7 days before competition for maximum effect. Most benefit seen in 10K-half marathon distances. Test in training - some experience GI issues."
  },
  {
    "topic": "Meal Timing Around Training",
    "source": "Nutrients - Nutrient Timing (2020)",
    "summary": "Training fasted (morning before breakfast) increases fat adaptation but impairs high-intensity performance. Training fed allows higher quality work. For most athletes, benefits of quality training outweigh fat adaptation. Match fueling strategy to session intensity and goals.",
    "action": "Easy/recovery sessions: can train fasted if desired (under 90 min). Hard sessions (intervals, tempo, long runs): eat 2-4 hours before. Early morning hard sessions: small snack 30-60 min before (banana, energy bar). Match fuel to intensity - harder sessions need more carbs."
  },
  {
    "topic": "Caloric Needs for Athletes",
    "source": "International Journal of Sport Nutrition (2021)",
    "summary": "Athletes require 35-50+ calories per kg bodyweight depending on training volume and goals. Endurance athletes burn 500-800+ extra calories per training hour. Chronic under-fueling (RED-S) causes hormonal disruption, injury risk, and performance decline. Track intake for 3-5 days to assess needs.",
    "action": "Calculate baseline: bodyweight (kg) × 35-40 for moderate training, × 45-50 for heavy training. Add training calories (estimate or use wearable). If losing weight unintentionally or performance declining, increase by 200-300 calories daily. Track weight and performance - adjust as needed."
  },
  {
    "topic": "Gut Training for Endurance",
    "source": "Sports Medicine - GI Tolerance (2020)",
    "summary": "Gastrointestinal distress affects 30-50% of endurance athletes during races. Gut can be trained to tolerate more fuel by gradually increasing intake during training. Start low (30-40g carbs/hour), progress to 60-90g over 6-8 weeks. Individual tolerance varies widely.",
    "action": "Practice race-day fueling in training progressively. Start: 30-40g carbs/hour during long runs. Gradually increase by 10-15g every 2 weeks. Test different products (gels, chews, drinks) to find what works. By race day, gut should tolerate 60-90g/hour without issues."
  },
  {
    "topic": "Alcohol & Recovery",
    "source": "Sports Medicine - Alcohol Effects (2021)",
    "summary": "Alcohol impairs muscle protein synthesis by 20-40%, disrupts sleep architecture (reduces REM and deep sleep), dehydrates, and slows glycogen replenishment. Even moderate intake (2-3 drinks) post-exercise negates recovery benefits. Effects magnified when combined with muscle damage or dehydration.",
    "action": "Avoid alcohol immediately post-training or competition (0-6 hours). If drinking socially, wait at least 6 hours post-exercise, rehydrate fully first, and limit to 1-2 drinks. Heavy drinking (4+ drinks) significantly impairs recovery for 24-48 hours. Minimize during heavy training blocks."
  },
  {
    "topic": "Energy Availability & RED-S",
    "source": "British Journal of Sports Medicine (2020)",
    "summary": "Relative Energy Deficiency in Sport (RED-S) occurs when energy intake doesn't match training expenditure. Causes hormonal disruption, bone loss, amenorrhea in women, injury risk, and performance decline. Requires 30+ calories per kg of fat-free mass. More common than recognized.",
    "action": "Warning signs: unintentional weight loss, missing periods (women), frequent injuries, chronic fatigue, declining performance despite training. If suspected: increase calories by 300-500 daily, reduce training volume 20-30%, work with sports dietitian. Prevention: don't chronically under-fuel."
  },
  {
    "topic": "Sodium Bicarbonate (Baking Soda)",
    "source": "Journal of the International Society of Sports Nutrition (2020)",
    "summary": "Sodium bicarbonate (0.3g per kg bodyweight) buffers lactic acid, improving performance in high-intensity efforts lasting 1-10 minutes by 2-3%. Take 60-90 min before exercise. Causes GI distress in 50% of users. Most beneficial for track events (800m-5K), repeated sprints, and VO2 max intervals.",
    "action": "For high-intensity races: 0.3g sodium bicarb per kg bodyweight (70kg = 21g or ~4 teaspoons) mixed in water, taken 60-90 min pre-race. Start with half dose in training to test tolerance. If GI issues occur, try enteric-coated capsules or split dose. Experimental - not for everyone."
  },
  {
    "topic": "Antioxidant Supplementation",
    "source": "Free Radical Biology and Medicine (2021)",
    "summary": "High-dose antioxidant supplements (vitamins C, E) may blunt training adaptations by 10-15% as some oxidative stress is necessary for adaptation. Antioxidants from whole foods (fruits, vegetables) are beneficial and don't impair adaptations. Megadose supplements should be avoided during training.",
    "action": "Get antioxidants from diet: colorful fruits/vegetables, berries, dark leafy greens. Avoid high-dose supplements (over 1000mg vitamin C or 400 IU vitamin E) during training phases. Can use during competition/recovery phases if desired. Food-based antioxidants are always safe and beneficial."
  },
  {
    "topic": "Hydration Status Monitoring",
    "source": "Journal of Athletic Training (2020)",
    "summary": "Urine color is simple hydration indicator: pale yellow = well-hydrated, dark yellow/amber = dehydrated. First morning urine slightly darker is normal. Body weight changes track acute hydration status. Chronic dehydration (starting training already down 2%) impairs performance before you feel thirsty.",
    "action": "Check urine color throughout day - aim for pale yellow. Weigh daily at same time (morning, post-bathroom). Weight fluctuations over 2 lbs suggest hydration changes. Start training fully hydrated. Pre-hydrate with 16-20oz water 2-3 hours before training. Don't wait until thirsty."
  },
  {
    "topic": "Sugar & Refined Carbohydrates",
    "source": "Nutrients - Sugar & Performance Review (2021)",
    "summary": "Chronic high sugar intake (especially added sugars and refined carbs) causes insulin resistance, inflammation, energy crashes, and impaired fat metabolism. Excess sugar promotes fat storage, disrupts gut health, and increases injury/illness risk by 20-30%. Athletes need carbs but should prioritize complex sources. Refined sugars best used only during/around training windows.",
    "action": "Limit added sugars to under 10% of daily calories (or 50g per day for most athletes). Save simple sugars for training windows: during workouts, immediately post-workout, or race fueling. Daily meals: prioritize complex carbs (oats, rice, potatoes, quinoa) over refined sources (candy, soda, pastries). Read labels - hidden sugars add up quickly."
  }
]
