[
  {
    "topic": "Race Week Routine & Consistency",
    "source": "International Journal of Sports Physiology (2020)",
    "summary": "Race week should maintain normal routines - sleep schedule, meal timing, easy training. Changes cause anxiety and unpredictability. Athletes who maintain consistent routines perform 5-10% better than those who drastically alter habits. Body responds best to familiarity. Only change is reducing training volume, not lifestyle patterns.",
    "action": "Race week consistency: Same wake/sleep times, same breakfast, same easy run routes, same evening routine. Don't try new foods, supplements, or routines. Stay off feet when possible (no extra walking, standing). Maintain normalcy everywhere except training volume. Familiarity reduces anxiety and optimizes performance."
  },
  {
    "topic": "Pre-Race Night Sleep",
    "source": "Sleep Medicine Reviews (2021)",
    "summary": "Night-before sleep matters less than two nights before. Pre-race anxiety often disrupts sleep night before - this is normal and doesn't significantly impact performance if prior sleep was good. Two nights before race is most critical. Poor sleep affects performance 36-48 hours later, not immediately. Don't panic about pre-race insomnia.",
    "action": "Sleep strategy: Prioritize sleep 2 nights before race (8-9 hours minimum). Night before: aim for 7-8 hours but don't stress if difficult. If struggling to sleep, rest in bed with eyes closed (still restorative). Prepare everything night before so morning is stress-free. Sleep debt from prior nights matters more than single night."
  },
  {
    "topic": "Race Morning Timing & Logistics",
    "source": "Sports Medicine - Pre-Competition Protocol (2020)",
    "summary": "Race morning requires precise timing: wake 3-4 hours before race, eat breakfast 2.5-3.5 hours before, arrive venue 60-90 min early. Rushing increases stress hormones and impairs warm-up. Early arrival allows bathroom visits, mental preparation, and proper warm-up. Buffer time reduces anxiety from unexpected delays.",
    "action": "Morning timeline: Wake 3-4 hours pre-race, bathroom, breakfast, digest while preparing gear. Leave with time buffer for parking/traffic. Arrive 75-90 min before start. Sequence: check in, bathroom, easy jog warm-up, dynamic stretching, strides, bathroom again, line up 10-15 min before start. Rehearse timing in training."
  },
  {
    "topic": "Pre-Race Warm-Up Protocol",
    "source": "Journal of Strength and Conditioning Research (2021)",
    "summary": "Optimal warm-up: 15-20 min easy jogging, 5-10 min dynamic stretching, 4-6 strides at race pace. Warm-up raises body temp, activates nervous system, and mentally prepares for effort. Longer warm-ups (20-30 min) needed for shorter, more intense races. Inadequate warm-up reduces performance by 5-10%, especially in first mile.",
    "action": "Standard warm-up: 1) 15-20 min easy jog (conversational pace), 2) Dynamic stretches (leg swings, lunges, high knees), 3) 4-6 × 100m strides building to race pace, 4) Final bathroom break, 5) Stay moving/loose until start. Finish warm-up 5-10 min before race start. Practice exact warm-up before hard training sessions."
  },
  {
    "topic": "Starting Line Mental Preparation",
    "source": "Psychology of Sport and Exercise (2020)",
    "summary": "Final minutes before start are critical for mental state. Controlled breathing (box breathing, 4-7-8) reduces excessive anxiety by 20-30%. Brief visualization (30-60 sec) of race execution primes nervous system. Positive self-talk ('I'm ready,' 'Trust the training') builds confidence. Avoid comparing yourself to other runners - focus inward.",
    "action": "Final 10 minutes: Find quiet space, practice controlled breathing (4-7-8 or box breathing for 2-3 min), visualize strong start and executing race plan, use activation cues ('fast, smooth, strong'), stay loose (light bouncing, arm swings). Avoid energy-draining conversations. Focus on controllables: your race, your execution, your effort."
  },
  {
    "topic": "First Mile Discipline",
    "source": "Sports Medicine - Pacing Strategies (2021)",
    "summary": "First mile determines race outcome more than any other segment. Starting 10-20 sec/mile too fast causes glycogen depletion and premature fatigue. Adrenaline makes conservative pace feel too easy - this is correct feeling. Athletes who run first mile 5-10 sec slower than goal pace typically negative split and perform better than those starting fast.",
    "action": "First mile execution: Start at back of pace group (not front), target 5-10 sec slower than goal pace, resist urge to chase early surge, check watch at mile 1 - if too fast, consciously slow. Mantra: 'Start controlled, finish strong.' Remember: you can't win race in first mile, but you can lose it. Patience pays."
  },
  {
    "topic": "Mid-Race Mental Strategies",
    "source": "Journal of Applied Sport Psychology (2020)",
    "summary": "Mental strategies during difficult mid-race periods improve performance by 5-10%. Effective techniques: breaking race into segments (focus only on next mile), using mantras ('strong,' 'smooth'), associative attention (body awareness) vs dissociative (external distraction). Reframing discomfort ('this is where I get stronger') reduces perceived exertion.",
    "action": "Mid-race toolkit: 1) Chunk race (focus mile by mile, not entire distance), 2) Use personal mantra during hard moments, 3) Focus on form cues (quick turnover, relaxed shoulders), 4) When struggling, count to 100 or focus on catching next runner, 5) Remind yourself 'everyone hurts, who handles it better?' Mental toughness wins races."
  },
  {
    "topic": "Fueling During Competition",
    "source": "Journal of Sports Sciences (2021)",
    "summary": "For races over 60 min, fueling strategy significantly impacts performance. Taking fuel early (before feeling depleted) prevents bonking. Water-only for under 60 min, sports drink or gels for 60-90 min, 30-60g carbs per hour for 90+ min races. Practicing fueling in training improves race-day gut tolerance by 30-40%.",
    "action": "Race fueling plan: Under 60 min - water only. 60-90 min - sports drink or 1 gel at halfway. 90+ min - gel every 30-45 min (start at 30 min mark, not when depleted). Practice exact strategy in training. Take fuel with water. If stomach sensitive, try different products during training - find what works before race day."
  },
  {
    "topic": "Final Kilometers & Finishing Strong",
    "source": "Sports Medicine - Endgame Strategies (2020)",
    "summary": "Final 10-20% of race separates placing and times. Most athletes unconsciously slow in final segments despite having reserve capacity. Mental cues and form focus enable strong finishes. 'Saving something' for finish line means you could have gone faster. All-out effort in final kilometer rarely causes collapse - conservative pacing protects against this.",
    "action": "Closing strategy: At 75% distance mark, assess energy. If feeling strong, gradually increase effort (don't surge dramatically). Final kilometer: full effort, focus on form (quick turnover, arm drive, forward lean), count steps or focus on catching runners ahead. Finish fast - empty the tank. Sprint final 200m if possible. No regrets at finish line."
  },
  {
    "topic": "Pacing in Different Conditions",
    "source": "International Journal of Sports Physiology (2021)",
    "summary": "Environmental conditions require pacing adjustments: heat (10-20 sec/mile slower), wind (15-30 sec/mile slower headwind sections), hills (even effort, not even pace), altitude (5-15% slower if unacclimated). Smart pacing adapts to conditions while maintaining even effort. Effort-based pacing beats pace-based pacing in variable conditions.",
    "action": "Condition adjustments: Heat - start conservative, increase hydration. Hills - effort stays constant (slow uphill, recover downhill), don't surge uphills. Wind - shelter behind others during headwind, push during tailwind. Altitude - reduce pace expectations, focus on effort/breathing. Course recon helps plan strategy. Even effort > even pace."
  },
  {
    "topic": "Between Events & Multi-Day Competitions",
    "source": "Sports Medicine - Recovery Between Events (2020)",
    "summary": "For competitions with multiple events (heats and finals, multi-day meets), recovery between efforts is critical. Active recovery (15-20 min easy movement) clears lactate 25% faster than passive rest. Compression gear, elevation, and refueling accelerate recovery. Mental reset between events prevents cumulative fatigue from affecting later performances.",
    "action": "Between-event protocol: 1) Cool down 15-20 min easy (walking or light jog), 2) Change into dry clothes, 3) Eat carbs + protein within 30 min (banana + protein shake), 4) Elevate legs 10-15 min, 5) Stay warm and loose, 6) Mental reset (don't obsess over previous race). If 2+ hours between: add light stretching and brief nap if possible."
  },
  {
    "topic": "Post-Race Analysis & Learning",
    "source": "Journal of Sport & Exercise Psychology (2021)",
    "summary": "Post-race reflection improves future performance by identifying what worked and what didn't. Wait 24-48 hours for emotions to settle before deep analysis. Objective assessment (splits, nutrition, pacing) reveals patterns. Both successful and unsuccessful races provide valuable data. Growth mindset athletes improve 25% more through deliberate post-race reflection.",
    "action": "Post-race review (48 hours later): 1) Analyze splits (where did you gain/lose time?), 2) Review pacing strategy (start too fast/slow?), 3) Assess fueling/hydration (any issues?), 4) Mental performance (stayed focused? positive?), 5) What went well? What to improve? 6) Adjust training based on insights. Every race is education - extract lessons."
  }
]
