[
  {
    "topic": "Squat Depth & Knee Tracking",
    "source": "Journal of Strength & Conditioning Research (2020)",
    "summary": "Knees can safely travel past toes when ankle mobility allows — it improves quad activation and maintains balance.",
    "action": "Keep heels down, push knees slightly forward over toes, maintain upright chest. Film side angle for review."
  },
  {
    "topic": "Hip Hinge Mechanics in Deadlifts",
    "source": "Strength and Conditioning Journal (2019)",
    "summary": "The hinge movement should come from the hips, not the lower back. Neutral spine reduces spinal shear forces.",
    "action": "Push hips back, slight bend in knees, keep bar close to shins. Engage core before pulling."
  },
  {
    "topic": "Bench Press Shoulder Position",
    "source": "Journal of Applied Biomechanics (2021)",
    "summary": "Scapular retraction stabilizes shoulders and prevents strain during bench press.",
    "action": "Pull shoulder blades together, keep elbows at 45°, and lightly touch chest each rep."
  },
  {
    "topic": "Overhead Press Bar Path",
    "source": "NSCA Exercise Technique Manual (2018)",
    "summary": "A straight bar path improves shoulder stability and reduces anterior deltoid strain.",
    "action": "Start with bar at collarbone, move slightly back as you press, lock out overhead with biceps near ears."
  },
  {
    "topic": "Lunges & Knee Stability",
    "source": "British Journal of Sports Medicine (2020)",
    "summary": "Front knee should track in line with toes to reduce ACL stress and improve balance.",
    "action": "Step long enough that front shin stays vertical, drive through heel, keep torso tall."
  },
  {
    "topic": "Lat Pulldown Grip Width",
    "source": "European Journal of Applied Physiology (2017)",
    "summary": "Medium grip activates lats most efficiently without excessive shoulder stress.",
    "action": "Grip slightly wider than shoulders, pull to upper chest, avoid leaning back too far."
  },
  {
    "topic": "Rowing Form & Scapular Control",
    "source": "Journal of Human Kinetics (2019)",
    "summary": "Full scapular retraction ensures balanced upper-back development.",
    "action": "Start with arms extended, pull elbows back, squeeze shoulder blades together, control return."
  },
  {
    "topic": "Plank Core Engagement",
    "source": "Journal of Sports Rehabilitation (2020)",
    "summary": "Proper tension prevents lumbar sag and improves core stability.",
    "action": "Brace abs like taking a punch, tuck hips slightly, maintain straight line from head to heels."
  },
  {
    "topic": "RDL Hamstring Tension",
    "source": "Strength and Conditioning Journal (2021)",
    "summary": "Slight knee bend with straight hips maximizes hamstring stretch while protecting back.",
    "action": "Hinge until hamstrings stretch, maintain neutral spine, return with hip drive."
  },
  {
    "topic": "Push-Up Elbow Angle",
    "source": "NSCA Guidelines (2020)",
    "summary": "45° elbow angle improves shoulder health and triceps engagement.",
    "action": "Keep elbows tucked slightly, body straight, chest touches ground lightly each rep."
  },
  {
    "topic": "Pull-Up Shoulder Activation",
    "source": "Frontiers in Sports Science (2019)",
    "summary": "Initiate with scapular depression for safer and more efficient pull-ups.",
    "action": "Before pulling, bring shoulders down and back, then drive elbows to ribs."
  },
  {
    "topic": "Glute Activation in Squats",
    "source": "Journal of Sports Sciences (2018)",
    "summary": "External rotation of the hips improves glute engagement and knee stability.",
    "action": "Slightly point toes outward, push knees out as you descend, squeeze glutes at top."
  },
  {
    "topic": "Tempo Training for Hypertrophy",
    "source": "Sports Medicine (2020)",
    "summary": "Slower eccentrics (3–4 seconds) enhance muscle growth by increasing time under tension.",
    "action": "Lower weight for 3–4 seconds, control bottom position, and explode up."
  },
  {
    "topic": "Foot Pressure in Lifts",
    "source": "International Journal of Sports Physiology (2019)",
    "summary": "Tripod foot contact increases stability during compound lifts.",
    "action": "Maintain pressure through heel, big toe, and pinky toe — avoid rocking forward or back."
  },
  {
    "topic": "Breathing During Lifts",
    "source": "Strength & Conditioning Journal (2019)",
    "summary": "Proper breathing maintains intra-abdominal pressure and spinal stability.",
    "action": "Inhale before descent, brace core, exhale through sticking point."
  },
  {
    "topic": "Pelvic Control in Lunges",
    "source": "Journal of Orthopaedic Research (2021)",
    "summary": "Neutral pelvis prevents anterior tilt and reduces hip strain.",
    "action": "Keep ribs stacked over hips, engage glutes, and avoid arching lower back."
  },
  {
    "topic": "Cable Row Elbow Path",
    "source": "Human Movement Science (2020)",
    "summary": "Elbows moving along ribcage enhance lat recruitment.",
    "action": "Pull elbows tight to sides, pause briefly, control eccentric."
  },
  {
    "topic": "Kettlebell Swing Hip Drive",
    "source": "Journal of Strength & Conditioning Research (2017)",
    "summary": "Explosive hip extension powers the swing — not the arms.",
    "action": "Snap hips forward, contract glutes hard, and let kettlebell float to chest height."
  },
  {
    "topic": "Split Squat Balance",
    "source": "Sports Biomechanics (2022)",
    "summary": "Rear-foot elevation changes load distribution and balance mechanics.",
    "action": "Keep front foot stable, lower straight down, avoid leaning forward."
  },
  {
    "topic": "Bicep Curl Wrist Alignment",
    "source": "European Journal of Applied Physiology (2019)",
    "summary": "Neutral wrist reduces forearm tension and isolates biceps.",
    "action": "Keep wrists straight, elbows fixed, full range of motion each rep."
  },
  {
    "topic": "Tricep Extension Elbow Control",
    "source": "Journal of Human Movement Science (2021)",
    "summary": "Elbows pinned close to body maximize triceps activation.",
    "action": "Avoid swinging arms, control tempo, fully extend without locking elbows."
  },
  {
    "topic": "Core Stability in Running",
    "source": "Sports Health (2020)",
    "summary": "Core control reduces energy leakage and improves stride efficiency.",
    "action": "Engage abs lightly while running, keep posture tall, avoid over-rotation."
  },
  {
    "topic": "Wrist Position in Presses",
    "source": "Strength & Conditioning Research (2018)",
    "summary": "Straight wrists prevent joint stress during pressing movements.",
    "action": "Stack wrists directly above elbows, avoid bending backward."
  },
  {
    "topic": "Shoulder External Rotation in Pulls",
    "source": "Physiotherapy in Sport (2021)",
    "summary": "External rotation stabilizes shoulders during pulling.",
    "action": "Rotate arms slightly outward, keep scapula retracted through the movement."
  },
  {
    "topic": "Lateral Raise Scapular Plane",
    "source": "Journal of Athletic Training (2019)",
    "summary": "Raising arms at a 30° angle in the scapular plane activates delts while protecting rotator cuff.",
    "action": "Lift arms slightly forward of body, stop at shoulder height, control down slowly."
  }
]
